src/cf/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВладельца</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ОбщиеФункции/Ext/Module.bsl
Функция ПолучитьСсылкуНаХранилищеФайлов(ПолноеИмяФайла,ИмяФайла,Расширение) Экспорт

	Строка = СокрЛП(ИмяФайла);
	мРасширение = "";
	i1 = СтрДлина(Строка);
	Пока i1 > 0 Цикл
		Если Сред(Строка,i1,1) = "." Тогда
			Прервать;
		КонецЕсли;
		мРасширение = Сред(Строка,i1,1) + мРасширение;
		i1 = i1 - 1;
	КонецЦикла;	
	if i1 = 0 Тогда
		мРасширение = "";
	КонецЕсли;
	
	Файл = Новый ДвоичныеДанные(ПолноеИмяФайла);
	НоваяЗапись = Справочники.Файлы.СоздатьЭлемент();
	НоваяЗапись.Наименование = ИмяФайла;
	НоваяЗапись.Расширение = мРасширение;
	НоваяЗапись.Расширение = Расширение;
	НоваяЗапись.ХранилищеФайла = Новый  ХранилищеЗначения(Файл);
	НоваяЗапись.Записать();
	Возврат НоваяЗапись.Ссылка;
КонецФункции

Функция ПолучитьЗначениеИзХранилища(мСсылка,АдресФайла) Экспорт
	
	//Строка = СокрЛП(АдресФайла);
	//мРасширение = "";
	//i1 = СтрДлина(Строка);
	//Пока i1 > 0 Цикл
	//	Если Сред(Строка,i1,1) = "." Тогда
	//		Прервать;
	//	КонецЕсли;
	//	мРасширение = Сред(Строка,i1,1) + мРасширение;
	//	i1 = i1 - 1;
	//КонецЦикла;	
	//
	//мАдресФайла = Сред(АдресФайла,1,i1) + мРасширение;
	//
	
	Файл = Новый ДвоичныеДанные(АдресФайла);
	Файл = мСсылка.ХранилищеФайла.Получить();
	Файл.Записать(АдресФайла);
	
	Возврат СокрЛП(мСсылка.Наименование);
КонецФункции
